Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Примечание: при работе следует учитывать, что фактически оба ограничения могут быть незначительно превышены при использовании подвыборки для автоподбора, так как последним этапом, который не учитывается ограничениями, будет осуществлено обучение лучшей Нейросети на полном наборе.
en: Note: In the course of the work it is required to take into account that practically both restrictions can be insignificantly exceeded when using subsample for autofit, as the best full set Neural Network will be trained at the last unrestricted stage.

source: Примечание: применение настройки Использовать пространство имен Loginom Integrator при публикации нескольких пакетов накладывает ограничение на именование публикуемых узлов.
en: Note: When Use Loginom Integrator namespace option is used to publish several packages, it restricts naming of the published packages.

source: Примечание: производный узел, так же, как и любой другой, работает в контексте того пакета, в котором он находится.
en: Note: The derived node is operated in the context of the package in which it is located as any other node.

source: Примечание: системные требования могут меняться в зависимости от объемов данных и взаимодействия со сторонними приложениями.
en: Note: The system requirements can be changed according to data volume and interoperating with third-party applications.

source: Примечание: следует иметь в виду, что узел при пакетном выполнении сценария может не выполняться в следующих ситуациях:
en: Note: It is required to take into account that the node cannot be executed during the workflow batch processing in the following situations:

source: Примечание: узел не обрабатывает поля с переменным типом данных (см.
en: Note: The node does not process the fields with the variable data type (refer to

source: Примечание: условие проверяется на атомарных значениях, например "A > 1".
en: Note: the condition is checked based on the atomic values, for example, "A > 1".

source: Примечание: Если связь между полем и объектом была установлена неправильно, ее можно удалить.
en: Note: If the link between the field and object has been incorrectly established, it can be deleted.

source: Примечание: Обработчик "Калькулятор" использует механизм ленивых вычислений, это означает, что расчет производится только тогда, когда значение выражения отображается или используется другим узлом сценария.
en: Note: The "Calculator" handler is based on the lazy computation technique. It means that the computation is performed only when the expression value is displayed or used by the other workflow node.

source: Примечание: По завершении корректировки параметров необходимо нажать кнопку Сохранить.
en: Note: It is required to press Save button upon completion of parameters correction.

source: Примечание: Поскольку входной набор данных с параметрами запросов является необязательным, то при его отсутствии узел вызова REST-сервиса отправит единичный запрос без параметров.
en: Note: As the input data set with the request parameters is optional, when it is not provided, the REST service call node will send the only request without parameters.

source: Примечание: если входной набор данных пустой, то на выходе количество строк равно нулю при любых настройках параметра Идентификация XML-документа.
en: Note: If the input data set is empty, the row count is equal to zero at the output with any settings of XML Document Identification.

source: Примечание: если связь между полем и объектом была установлена неправильно, ее можно удалить.
en: Note: If the link between the field and object has been incorrectly established, it can be deleted.

source: Примечание: значения используемых терминов можно посмотреть на странице Термины.
en: Note: Values of the used terms are available on Terms page.

source: Примечание: поскольку входной набор данных с параметрами запросов является необязательным, то при его отсутствии узел вызова SOAP-сервиса отправит единичный SOAP-запрос без параметров.
en: Note: As the input data set with the request parameters is optional, when it is not provided, the SOAP service call node will send the only SOAP request without parameters.

source: Примечание: сравнение и сортировка символов осуществляется в соответствии с локальными настройками пользователя, из-под которого запущен сервер Loginom.
en: Note: Comparison and sorting of characters are performed according to the local settings of the user that started the Loginom server.

source: Примечание: сравнение и сортировка символов осуществляется в соответствии с локальными настройками пользователя, под учетной записью которого запущен Loginom.
en: Note: Сharacters are compared and sorted according to the local settings of the user whose login is used to start Loginom.

source: Примечание: цветовая индикация для портов переменных, подключений и портов, с неопределенной структурой данных является аналогичной рассмотренной выше.
en: Note: Color indication of the ports of variables, connections and the ports with undefined data structure is similar to the one analyzed above.

source: Примечания:
en: Notes:

source: Принимать несколько подряд разделителей за один — установка флага позволит принимать несколько подряд идущих разделителей столбцов за один.
en: Treat consecutive delimiters as one: checkbox selection enables to treat several consecutive column delimiters as one.

source: Принудительное включение (Enter) — включение в регрессионную модель всех заданных признаков независимо от того, оказывают ли они значимое влияние или нет.
en: Enter: enter all set indicators into the regression model irrespective of the fact whether they have meaningful influence or not.

source: Принципы проектирования
en: Design principles

source: Приоритет меньше/больше факторов
en: Less/more factors priority

source: Приоритет тестового множества (необязательный флаг). Активация данного флага приводит к тому, что сначала отбираются записи для тестовой выборки, а оставшиеся используются для обучающей.
en: Test set priority (optional checkbox). Selection of this checkbox enables to select the records for the test sample first, whereas the remaining ones are used for the training one.

source: Приоритет точность/скорость
en: Accuracy/speed priority

source: Приоритет точные/недостоверные данные
en: Exact/inexact data priority

source: Присоединяемая таблица Присоединяемая таблица — в контексте понятий языка SQL-запросов является правой таблицей для соединения;
en: Joined table Joined table is the right table to be joined in the context of the SQL queries terms.

source: Присоединяемая таблица Присоединяемая таблица — вторая таблица участвующая в объединении, все последующие таблицы добавляются через Добавить еще один порт;
en: Joined table Joined table is the second table participating in the union. All subsequent tables are added by means of Add another port.

source: Присоединяемая таблица Присоединяемая таблица — таблица, наборы данных которой добавляются к главной таблице (в контексте понятий языка SQL запросов принимает данные правой таблицы для соединения).
en: Joined table Joined table: the table data sets of which are appended to the main table (in the context of the SQL terms, it accepts the right table data for join).

source: Проверить наличие обновления — проверка актуальных версий платформы на сайте разработчика.
en: Check for updates: check for current released platform versions on the vendor's website.

source: Проверять на строгое соответствие XSD — при установке флага производится валидация XML на строгое соответствие XSD схеме.
en: Check for strict XSD validation: when this checkbox is selected, XML is validated for strict compliance with the XSD schema.

source: Проверять на строгое соответствие XSD — при установке флага производится валидация XML ответа сервиса на строгое соответствие XSD схеме, заявленной в WSDL веб-сервиса.
en: Check for strict XSD validation: when this checkbox is selected, XML is validated for strict compliance with the XSD schema stated in WSDL of the web service.

source: Проект — комплекс сценариев, файлов, источников данных и прочих элементов, предназначенных для решения отдельной аналитической задачи.
en: The Project: complex of workflows, files, data sources and other items designated for solution of a particular analytical task.

source: Проектирование сценариев
en: Workflows design

source: Производные компоненты - создаются и настраиваются пользователем.
en: Derived components are created and configured by a user.

source: Производные компоненты — создаваемые пользователями компоненты на основе базовых;
en: Derived components are the components created by users according to the base ones.

source: Производные компоненты — создаются и настраиваются пользователем.
en: Derived components are created and configured by a user.

source: Производный компонент
en: Derived component

source: Производный компонент — создаваемый пользователем компонент, который может применяться в Сценариях наравне со стандартными, предоставляемыми платформой компонентами.
en: Derived component is the component created by a user than can be used in the Workflows alongside with the standard components provided by the platform.

source: Промежуточная модель — модель, которую создал алгоритм в процессе обучения;
en: Intermediate model: the model created by the algorithm in the training process.

source: Промежуточное — при установке этого флага выражение может использоваться в расчетах, не включается в список полей выходного набора данных;
en: Intermediate: when selecting this checkbox, the expression can be used in calculations but it is not included into the list of fields of the output data set.

source: Промежуточное — при установке этого флага выражение может использоваться в расчетах, но не включается в список переменных выходного набора данных;
en: Intermediate: when selecting this checkbox, the expression can be used in calculations but it is not included into the list of variables of the output data set.

source: Пропорционально — разница распределяется частями, пропорциональными величине разгруппированных значений.
en: Proportionally: the difference is distributed by the parts proportional to the size of ungrouped values.

source: Пропуски Пропуски;
en: Null count Null count;

source: Пропустить строк — количество строк с начала текста, не подлежащее импорту.
en: Skip rows: count of the rows from the text beginning that cannot be imported.

source: Просмотр выбранного файла — область позволяет увидеть содержание выбранного для импорта файла.
en: Preview selected file enables to view content of the file selected for import.

source: Простая — то же, что и "Индикатор", но вместо 0 используется значение -1/n, а вместо 1 используется значение 1-1/n.
en: Simple means the same as the "Indicator", but value -1/n is used instead of 0, and value 1-1/n is used instead of 1.

source: Пространство имен — выбор пространства имен из списка всех пространств имен описанных в *.xsd-файле, ограничивает выбор корневого элемента только указанным пространством.
en: Namespace enables to select a namespace from a list of all namespaces described in the *.xsd file. It limits selection of the root element only by the specified space.

source: Пространство имен — выбор пространства имен из списка всех пространств имен описанных в файле XSD, ограничивает выбор корневого элемента только указанным пространством.
en: Namespace enables to select a namespace from a list of all namespaces described in the XSD file. It limits selection of the root element only by the specified space.

source: Протестировать подключение — проверка возможности подключения при заданных настройках.
en: Test connection: connectivity test with the specified settings.

source: Протестировать подключение — тест указанных настроек подключения.
en: Test connection: test of the specified connection settings.

source: Протестировать подключение — тест указанных настроек подключения;
en: Test connection: test of the specified connection settings.

source: Протокол — протокол, используемый сервером для взаимодействия с клиентом.
en: Protocol: the protocol that is used by the server for interaction with a client.

source: Процент по вертикали Процент по вертикали — факты будут отображаться в процентах от итогового значения по столбцам.
en: Percent by column Percent by column: measures will be displayed as percentage of the final value by columns.

source: Процент по горизонтали Процент по горизонтали — факты будут отображаться в процентах от итогового значения по строкам;
en: Percent by row Percent by row: measures will be displayed as percentage of the final value by rows.

source: Процесс — совокупность измерений, фактов и атрибутов.
en: Process is a set of dimensions, measures and attributes.

source: Процессы.
en: Processes

source: Прочие функции
en: Other functions

source: Публикация веб-сервиса
en: Web service publication

source: Пусто (Имя измерения.IsNull) — проверка, является ли значение измерения пропущенным значением.
en: Null (Dimension name.IsNull): check whether the dimension value is the null value.

source: Пусто – текст, представляющий значение Null.
en: Null: the text that represents the Null value.

source: Пусто — текст, представляющий значение Null.
en: Null: the text that represents the Null value.

source: Пустые строки — поскольку диапазон ячеек, заданный предыдущими параметрами, может содержать пустые строки, то предлагается выбрать один из вариантов их обработки.
en: Blank rows: as the range of cells set according to the previous parameters can contain blank rows, it is requested to select one of options of their processing.

source: Путь к файлу пакета — указывается вручную или выбирается из выпадающего списка открытых пакетов.
en: Path to the package file is manually specified or selected from the drop-down list of the opened packages.

source: Путь — здесь отображается как будет выглядеть путь к папке относительно корня.
en: Path: it is displayed here how the path to the folder relative to the root will look like.

source: Путь — путь до открытого Пакета.
en: Path: the path to the opened Package.

source: Рабочее окно Loginom.
en: Work window of Loginom platform

source: Рабочее пространство Studio.
en: Working Space of Studio.

source: Рабочее пространство.
en: Working space

source: Рабочее пространство
en: Working space

source: Рабочее пространство — панель компонентов, панель инструментов и область построения Сценариев;
en: Working space: the panel of components, toolbar and area of the Workflows construction.

source: Равномерно — распределяется между разгруппированными значениями поровну.
en: Evenly: the difference is evenly distributed between ungrouped values.

source: Равномерный случайный — все записи исходного набора данных разделяются на группы и затем из каждой группы случайным образом выбираются и помещаются в результирующую выборку.
en: Random uniform: all records of the source data set are divided into groups, and then they are randomly selected from each group and placed into the resulting sample.

source: Разбиение на множества;
en: Partitioning.

source: Разбиение по уникальным значениям полей — следует выбрать в списке поля исходного набора, задающие уникальный идентификатор группы строк.
en: Grouping by the unique fields values: it is required to select the listed fields of the source data set that enable to set the unique identifier of the row group.

source: Разбить по границе — установка новой дополнительной границы, а значит увеличение числа конечных классов на 1 (операция обратная командам Объединить со следующим/Объединить с предыдущим);
en: Bound split: enables to set the new additional bound and, thus, increase the coarse classes count by 1 (this operation is opposed to Merge with next/Merge with previous commands).

source: Разброс Разброс.
en: Scatter Scatter.

source: Развернуть все.
en: Expand all.

source: Развернуть дерево Развернуть дерево — развернуть дерево вариантов агрегации и способов отображения;
en: Expand tree Expand tree enables to expand the tree of aggregation options and representation methods.

source: Развернуть колонки.
en: Expand columns.

source: Развернуть строки.
en: Expand rows.

source: Разгруппированное значение — в текущем примере это детализация продаж товаров, измеряемая в тыс.
en: Ungrouped value: detailing of the goods sales measured in thous. is shown in this example.

source: Разгруппированное значение — поле содержит значения разгруппированные согласно Методу разгруппировки.
en: Ungrouped value: the field contains the values ungrouped according to the Ungrouping method.

source: Разгруппировка
en: Ungroup

source: Разгруппировка Разгруппировка
en: Ungroup Ungroup

source: Разгруппируемое Разгруппируемое — назначение выставляется полю таблицы разгруппируемых данных, к которому и будет применена разгруппировка.
en: Ungroupable Ungroupable: the usage type is assigned to the table field of ungrouped data to which ungrouping will be applied.

source: Разгруппируемые данные Разгруппируемые данные — таблица, содержащая поле для разгруппировки;
en: Ungrouped data Ungrouped data: the table that contains ungrouping field.

source: Разделитель времени – символ, разделяющий компоненты времени.
en: Time separator: the character that separates time components.

source: Разделитель времени — символ, разделяющий компоненты времени.
en: Time separator: the character that separates time components.

source: Разделитель даты – символ, разделяющий компоненты даты.
en: Date separator: the character that separates date components.

source: Разделитель даты — символ, разделяющий компоненты даты.
en: Date separator: the character that separates date components.

source: Разделитель разрядов — группировка цифр по разрядам.
en: Thousands separator: digits grouping by decimal places.

source: Разделитель столбцов — символ, разделяющий данные соседних столбцов.
en: Column delimiter: the character separating data of adjacent columns.

source: Разделитель частей меток полей — выбирается каким символом будут разделены метки новых полей, при выборе нескольких полей в колонках.
en: Field caption parts separator: it is required to select the character to separate the new fields captions when selecting several fields in the columns.

source: Размах Размах;
en: Range Range;

source: Размер выборки в процентах — размер подвыборки обучающего множества;
en: Percent sample size: the size of the training set subsample.

source: Размер кэша — устанавливает размер кэша.
en: Cache size enables to set the cache size.

source: Разморозить выбранные — изменить статус поля на Разморожено (т.е. поле может быть использовано в процессе формирования конечных классов при переобучении), команда также доступна при нажатии на кнопку Разморожено слева от каждого входного столбца.
en: Unlock selected: enables to change the field status to Unlocked (thus, the field can be used in the process of the coarse classes generation while retraining). The command is also available by pressing Unlocked button to the left of each input column.

source: Разность
en: Difference

source: Разность Разность
en: Difference Difference

source: Разность — уникальные значения упорядочиваются, после чего каждое уникальное значение сравнивается со следующим по таблице вида:
en: Difference: the unique values are ordered, then each unique value is compared with the next one according to the following table:

source: Разрядность — выводит информацию о разрядности LGD-файла: 64 или 32 бита.
en: Bitness enables to display information on bitness of the LGD file: 64 or 32 bits.

source: Разрядность — выводит информацию о разрядности импортируемого файла: 64 или 32 бита.
en: Bitness enables to display information on bitness of the imported file: 64 or 32 bits.

source: Разэкранировать сущности XML — применяется в том случае, если документы извлекаются из другого документа XML, в котором они были заэкранированы.
en: Unescape XML entities is applied if the documents are extracted from another XML document in which they have been escaped.

source: Раскрывающиеся списки полей — содержатся в каждой строке таблицы сопоставления.
en: Drop-down lists of fields are in each row of the mapping table.

source: Распознано — количество распознанных событий от общего числа событий.
en: Recognized: the number of recognized events from the total number of events.

source: Расположение XSLT — в данном поле указывается URL или расположение (в файловом хранилище) XSLT-файла.
en: XSLT path: URL or path (in file storage) of XSLT file is specified in this field.

source: Расположение серий — позволяет выбрать расположение серий:
en: Series position enables to select position of series:

source: Расстояние до узла — евклидово расстояние до ближайшего узла, т.е. того, которому принадлежит объект.
en: Distance to node: the Euclidean distance to the nearest node, namely, to the node of the object.

source: Расстояние до центра кластера — положение объекта относительно центра кластера.
en: Distance to cluster center: the object location relative to the cluster center.

source: Рассчитать доверительный интервал — позволяет вручную задать настройку следующего параметра:
en: Calculate confidence interval provides manual setting of the following parameter:

source: Рассчитать ошибку аппроксимации — флаг, установка которого добавляет в выходной набор столбец со средними отклонениями прогнозируемых значений от фактических.
en: Calculate the approximation error: selection of this checkbox enables to add a column with the mean deviations of the forecast values from the actual ones to the output data set.

source: Рассчитывать ЧАКФ — наличие данного флага добавляет вычисление частной автокорреляционной функции.
en: Calculate PACF: availability of this checkbox adds calculation of partial autocorrelation function.

source: Регистр данных — у полей со Строковым или Переменным типом данных указывается их регистрозависимость при сортировке.
en: Data case: case sensitivity of fields while sorting is specified for the fields with String or Variable data type.

source: Регистр — в ячейках этого поля, при условии что сортируемые значения Строковый типСтрокового или Переменный типПеременного типов, отображается чекбокс.
en: Case-sensitive: in the cells of this field on condition that the sorted values String typeString or Variant typeVariant types, the checkbox is displayed.

source: Регистр — для сортировки строковых полей с учетом регистра нужно поставить флаг в чекбоксе этого поля.
en: Case: to sort the string fields taking into account the case, it is required to select a checkbox in this field.

source: Регистрозависимые строки — флаг устанавливает регистрозависимый режим поиска значений в таблицах замен.
en: Case-sensitive strings: the checkbox installs the case-sensitive mode of values search in the replacement tables.

source: Регулярное выражение
en: Regular expression

source: Регулярному выражению (применимо только к данным строкового типа).
en: Regular expression (it is applied only to the data of the string type).

source: Редактировать параметры порта Редактировать — редактировать параметры порта.
en: Edit port parameters Edit eanbles to edit port parameters.

source: Редактировать текущую замену Редактировать текущую замену — отображает область редактирования текущей строки таблицы подстановок;
en: Edit current replacement Edit current replacement enables to display the editing area of the current string of the substitution table.

source: Редактировать текущую замену Редактировать — отображает область редактирования текущей строки таблицы подстановок.
en: Edit current replacement Edit enables to display the editing area of the current string of the substitution table.
